# Add new word!!!
new_word_split_dict = {'山尧':'峣',
                        '八白': '㒶',
                       '入工':'㒰',
                       '王已':'玘',
                       '宀晨':'宸',
                       '讠虎':'諕',
                       '纟郎':'鄕',
                       '纟爱':'缓',
                       '糹愛':'緩',
                       '女羽':'𪥵',
                      # '':'',
                       '女合羽':'嬆',
                       '男男女':'嬲',
                       '火西土':'煙',
                       '艹日十':'草',
                       '石人工':'砼',
                       '文武贝':'赟',
                       '文武貝':'贇',
                       '龙龙龙':'龘',
                       '口口口口':'㗊',
                        '水水水水':'㵘',
                        '土土土土':'㙓',
                       '又又又又支':'敠'}


# new_word_pianpang_dict = {'利刀旁':'刂','禾字旁':'禾'}


new_word_pinyin_dict = {'㒶': [['gōng']],
                        '𪥵': [['xǔ']],
                        '敠': [['duō'], ['què']]}

